remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_dwt.h
/**
 * \file
 *
 * \brief Component description for ARM_DWT
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_ARM_DWT_COMPONENT_
#define _SAMB11_ARM_DWT_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ARM_DWT */
/* ========================================================================== */
/** \addtogroup SAMB11_ARM_DWT ARM DWT Control 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define ARM_DWT_ADWT1234
#define REV_ARM_DWT                      0x100

/* -------- ARM_DWT_DWT_CTRL : (ARM_DWT Offset: 0x00) (R/ 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :28;                       /**< bit:  0..27  Reserved */
    uint32_t NUMCOMP:4;                 /**< bit: 28..31  Number of comparators available          */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_DWT_DWT_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_CTRL_OFFSET             0x00                                          /**<  (ARM_DWT_DWT_CTRL) Control Register  Offset */
#define ARM_DWT_DWT_CTRL_RESETVALUE         0x00u                                         /**<  (ARM_DWT_DWT_CTRL) Control Register  Reset Value */

#define ARM_DWT_DWT_CTRL_NUMCOMP_Pos        28                                             /**< (ARM_DWT_DWT_CTRL) Number of comparators available Position */
#define ARM_DWT_DWT_CTRL_NUMCOMP_Msk        (0xFu << ARM_DWT_DWT_CTRL_NUMCOMP_Pos)         /**< (ARM_DWT_DWT_CTRL) Number of comparators available Mask */
#define ARM_DWT_DWT_CTRL_NUMCOMP(value)     (ARM_DWT_DWT_CTRL_NUMCOMP_Msk & ((value) << ARM_DWT_DWT_CTRL_NUMCOMP_Pos))
#define ARM_DWT_DWT_CTRL_MASK               0xF0000000u                                    /**< \deprecated (ARM_DWT_DWT_CTRL) Register MASK  (Use ARM_DWT_DWT_CTRL_Msk instead)  */
#define ARM_DWT_DWT_CTRL_Msk                0xF0000000u                                    /**< (ARM_DWT_DWT_CTRL) Register Mask  */

/* -------- ARM_DWT_DWT_PCSR : (ARM_DWT Offset: 0x1c) (R/ 32) Program Counter Sample Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EIASAMPLE:32;              /**< bit:  0..31  Executed Instruction Address sample value */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_DWT_DWT_PCSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_PCSR_OFFSET             0x1C                                          /**<  (ARM_DWT_DWT_PCSR) Program Counter Sample Register  Offset */
#define ARM_DWT_DWT_PCSR_RESETVALUE         0x00u                                         /**<  (ARM_DWT_DWT_PCSR) Program Counter Sample Register  Reset Value */

#define ARM_DWT_DWT_PCSR_EIASAMPLE_Pos      0                                              /**< (ARM_DWT_DWT_PCSR) Executed Instruction Address sample value Position */
#define ARM_DWT_DWT_PCSR_EIASAMPLE_Msk      (0xFFFFFFFFu << ARM_DWT_DWT_PCSR_EIASAMPLE_Pos)  /**< (ARM_DWT_DWT_PCSR) Executed Instruction Address sample value Mask */
#define ARM_DWT_DWT_PCSR_EIASAMPLE(value)   (ARM_DWT_DWT_PCSR_EIASAMPLE_Msk & ((value) << ARM_DWT_DWT_PCSR_EIASAMPLE_Pos))
#define ARM_DWT_DWT_PCSR_MASK               0xFFFFFFFFu                                    /**< \deprecated (ARM_DWT_DWT_PCSR) Register MASK  (Use ARM_DWT_DWT_PCSR_Msk instead)  */
#define ARM_DWT_DWT_PCSR_Msk                0xFFFFFFFFu                                    /**< (ARM_DWT_DWT_PCSR) Register Mask  */

/* -------- ARM_DWT_DWT_COMP0 : (ARM_DWT Offset: 0x20) (R/W 32) DWT Compare Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t COMP:32;                   /**< bit:  0..31  Reference Value for Comparison           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_DWT_DWT_COMP0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_COMP0_OFFSET            0x20                                          /**<  (ARM_DWT_DWT_COMP0) DWT Compare Register 0  Offset */
#define ARM_DWT_DWT_COMP0_RESETVALUE        0x00u                                         /**<  (ARM_DWT_DWT_COMP0) DWT Compare Register 0  Reset Value */

#define ARM_DWT_DWT_COMP0_COMP_Pos          0                                              /**< (ARM_DWT_DWT_COMP0) Reference Value for Comparison Position */
#define ARM_DWT_DWT_COMP0_COMP_Msk          (0xFFFFFFFFu << ARM_DWT_DWT_COMP0_COMP_Pos)    /**< (ARM_DWT_DWT_COMP0) Reference Value for Comparison Mask */
#define ARM_DWT_DWT_COMP0_COMP(value)       (ARM_DWT_DWT_COMP0_COMP_Msk & ((value) << ARM_DWT_DWT_COMP0_COMP_Pos))
#define ARM_DWT_DWT_COMP0_MASK              0xFFFFFFFFu                                    /**< \deprecated (ARM_DWT_DWT_COMP0) Register MASK  (Use ARM_DWT_DWT_COMP0_Msk instead)  */
#define ARM_DWT_DWT_COMP0_Msk               0xFFFFFFFFu                                    /**< (ARM_DWT_DWT_COMP0) Register Mask  */

/* -------- ARM_DWT_DWT_MASK0 : (ARM_DWT Offset: 0x24) (R/W 8) DWT Mask Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  MASK_VALUE:5;              /**< bit:   0..4  Size of the ignore mask applied to address range matching */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_MASK0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_MASK0_OFFSET            0x24                                          /**<  (ARM_DWT_DWT_MASK0) DWT Mask Register 0  Offset */
#define ARM_DWT_DWT_MASK0_RESETVALUE        0x00u                                         /**<  (ARM_DWT_DWT_MASK0) DWT Mask Register 0  Reset Value */

#define ARM_DWT_DWT_MASK0_MASK_VALUE_Pos    0                                              /**< (ARM_DWT_DWT_MASK0) Size of the ignore mask applied to address range matching Position */
#define ARM_DWT_DWT_MASK0_MASK_VALUE_Msk    (0x1Fu << ARM_DWT_DWT_MASK0_MASK_VALUE_Pos)    /**< (ARM_DWT_DWT_MASK0) Size of the ignore mask applied to address range matching Mask */
#define ARM_DWT_DWT_MASK0_MASK_VALUE(value) (ARM_DWT_DWT_MASK0_MASK_VALUE_Msk & ((value) << ARM_DWT_DWT_MASK0_MASK_VALUE_Pos))
#define ARM_DWT_DWT_MASK0_Msk               0x1Fu                                          /**< (ARM_DWT_DWT_MASK0) Register Mask  */

/* -------- ARM_DWT_DWT_FUNCTION0 : (ARM_DWT Offset: 0x28) (R/ 32) DWT Function Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FUNCTION:4;                /**< bit:   0..3  Select action on comparator match        */
    uint32_t :20;                       /**< bit:  4..23  Reserved */
    uint32_t MATCHED:1;                 /**< bit:     24  Comparator Match                         */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_DWT_DWT_FUNCTION0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_FUNCTION0_OFFSET        0x28                                          /**<  (ARM_DWT_DWT_FUNCTION0) DWT Function Register 0  Offset */
#define ARM_DWT_DWT_FUNCTION0_RESETVALUE    0x00u                                         /**<  (ARM_DWT_DWT_FUNCTION0) DWT Function Register 0  Reset Value */

