remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_dwt.h
#define ARM_DWT_DWT_FUNCTION0_FUNCTION_Pos  0                                              /**< (ARM_DWT_DWT_FUNCTION0) Select action on comparator match Position */
#define ARM_DWT_DWT_FUNCTION0_FUNCTION_Msk  (0xFu << ARM_DWT_DWT_FUNCTION0_FUNCTION_Pos)   /**< (ARM_DWT_DWT_FUNCTION0) Select action on comparator match Mask */
#define ARM_DWT_DWT_FUNCTION0_FUNCTION(value) (ARM_DWT_DWT_FUNCTION0_FUNCTION_Msk & ((value) << ARM_DWT_DWT_FUNCTION0_FUNCTION_Pos))
#define   ARM_DWT_DWT_FUNCTION0_FUNCTION_0_Val 0x0u                                           /**< (ARM_DWT_DWT_FUNCTION0) Disabled  */
#define   ARM_DWT_DWT_FUNCTION0_FUNCTION_4_Val 0x4u                                           /**< (ARM_DWT_DWT_FUNCTION0) PC Watchpoint Event (Instruction)  */
#define   ARM_DWT_DWT_FUNCTION0_FUNCTION_5_Val 0x5u                                           /**< (ARM_DWT_DWT_FUNCTION0) Watchpoint Event Read Only (Data)  */
#define   ARM_DWT_DWT_FUNCTION0_FUNCTION_6_Val 0x6u                                           /**< (ARM_DWT_DWT_FUNCTION0) Watchpoint Event Write Only (Data)  */
#define   ARM_DWT_DWT_FUNCTION0_FUNCTION_7_Val 0x7u                                           /**< (ARM_DWT_DWT_FUNCTION0) Watchpoing Event Write-Read (Data)  */
#define ARM_DWT_DWT_FUNCTION0_FUNCTION_0    (ARM_DWT_DWT_FUNCTION0_FUNCTION_0_Val << ARM_DWT_DWT_FUNCTION0_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION0) Disabled Position  */
#define ARM_DWT_DWT_FUNCTION0_FUNCTION_4    (ARM_DWT_DWT_FUNCTION0_FUNCTION_4_Val << ARM_DWT_DWT_FUNCTION0_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION0) PC Watchpoint Event (Instruction) Position  */
#define ARM_DWT_DWT_FUNCTION0_FUNCTION_5    (ARM_DWT_DWT_FUNCTION0_FUNCTION_5_Val << ARM_DWT_DWT_FUNCTION0_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION0) Watchpoint Event Read Only (Data) Position  */
#define ARM_DWT_DWT_FUNCTION0_FUNCTION_6    (ARM_DWT_DWT_FUNCTION0_FUNCTION_6_Val << ARM_DWT_DWT_FUNCTION0_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION0) Watchpoint Event Write Only (Data) Position  */
#define ARM_DWT_DWT_FUNCTION0_FUNCTION_7    (ARM_DWT_DWT_FUNCTION0_FUNCTION_7_Val << ARM_DWT_DWT_FUNCTION0_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION0) Watchpoing Event Write-Read (Data) Position  */
#define ARM_DWT_DWT_FUNCTION0_MATCHED_Pos   24                                             /**< (ARM_DWT_DWT_FUNCTION0) Comparator Match Position */
#define ARM_DWT_DWT_FUNCTION0_MATCHED_Msk   (0x1u << ARM_DWT_DWT_FUNCTION0_MATCHED_Pos)    /**< (ARM_DWT_DWT_FUNCTION0) Comparator Match Mask */
#define ARM_DWT_DWT_FUNCTION0_MATCHED       ARM_DWT_DWT_FUNCTION0_MATCHED_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_DWT_DWT_FUNCTION0_MATCHED_Msk instead */
#define ARM_DWT_DWT_FUNCTION0_MASK          0x100000Fu                                     /**< \deprecated (ARM_DWT_DWT_FUNCTION0) Register MASK  (Use ARM_DWT_DWT_FUNCTION0_Msk instead)  */
#define ARM_DWT_DWT_FUNCTION0_Msk           0x100000Fu                                     /**< (ARM_DWT_DWT_FUNCTION0) Register Mask  */

/* -------- ARM_DWT_DWT_COMP1 : (ARM_DWT Offset: 0x30) (R/W 32) DWT Compare Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t COMP:32;                   /**< bit:  0..31  Reference Value for Comparison           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_DWT_DWT_COMP1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_COMP1_OFFSET            0x30                                          /**<  (ARM_DWT_DWT_COMP1) DWT Compare Register 1  Offset */
#define ARM_DWT_DWT_COMP1_RESETVALUE        0x00u                                         /**<  (ARM_DWT_DWT_COMP1) DWT Compare Register 1  Reset Value */

#define ARM_DWT_DWT_COMP1_COMP_Pos          0                                              /**< (ARM_DWT_DWT_COMP1) Reference Value for Comparison Position */
#define ARM_DWT_DWT_COMP1_COMP_Msk          (0xFFFFFFFFu << ARM_DWT_DWT_COMP1_COMP_Pos)    /**< (ARM_DWT_DWT_COMP1) Reference Value for Comparison Mask */
#define ARM_DWT_DWT_COMP1_COMP(value)       (ARM_DWT_DWT_COMP1_COMP_Msk & ((value) << ARM_DWT_DWT_COMP1_COMP_Pos))
#define ARM_DWT_DWT_COMP1_MASK              0xFFFFFFFFu                                    /**< \deprecated (ARM_DWT_DWT_COMP1) Register MASK  (Use ARM_DWT_DWT_COMP1_Msk instead)  */
#define ARM_DWT_DWT_COMP1_Msk               0xFFFFFFFFu                                    /**< (ARM_DWT_DWT_COMP1) Register Mask  */

/* -------- ARM_DWT_DWT_MASK1 : (ARM_DWT Offset: 0x34) (R/W 8) DWT Mask Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  MASK_VALUE:5;              /**< bit:   0..4  Size of the ignore mask applied to address range matching */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_MASK1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_MASK1_OFFSET            0x34                                          /**<  (ARM_DWT_DWT_MASK1) DWT Mask Register 1  Offset */
#define ARM_DWT_DWT_MASK1_RESETVALUE        0x00u                                         /**<  (ARM_DWT_DWT_MASK1) DWT Mask Register 1  Reset Value */

#define ARM_DWT_DWT_MASK1_MASK_VALUE_Pos    0                                              /**< (ARM_DWT_DWT_MASK1) Size of the ignore mask applied to address range matching Position */
#define ARM_DWT_DWT_MASK1_MASK_VALUE_Msk    (0x1Fu << ARM_DWT_DWT_MASK1_MASK_VALUE_Pos)    /**< (ARM_DWT_DWT_MASK1) Size of the ignore mask applied to address range matching Mask */
#define ARM_DWT_DWT_MASK1_MASK_VALUE(value) (ARM_DWT_DWT_MASK1_MASK_VALUE_Msk & ((value) << ARM_DWT_DWT_MASK1_MASK_VALUE_Pos))
#define ARM_DWT_DWT_MASK1_Msk               0x1Fu                                          /**< (ARM_DWT_DWT_MASK1) Register Mask  */

/* -------- ARM_DWT_DWT_FUNCTION1 : (ARM_DWT Offset: 0x38) (R/ 32) DWT Function Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FUNCTION:4;                /**< bit:   0..3  Select action on comparator match        */
    uint32_t :20;                       /**< bit:  4..23  Reserved */
    uint32_t MATCHED:1;                 /**< bit:     24  Comparator Match                         */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_DWT_DWT_FUNCTION1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_FUNCTION1_OFFSET        0x38                                          /**<  (ARM_DWT_DWT_FUNCTION1) DWT Function Register 1  Offset */
#define ARM_DWT_DWT_FUNCTION1_RESETVALUE    0x00u                                         /**<  (ARM_DWT_DWT_FUNCTION1) DWT Function Register 1  Reset Value */

#define ARM_DWT_DWT_FUNCTION1_FUNCTION_Pos  0                                              /**< (ARM_DWT_DWT_FUNCTION1) Select action on comparator match Position */
#define ARM_DWT_DWT_FUNCTION1_FUNCTION_Msk  (0xFu << ARM_DWT_DWT_FUNCTION1_FUNCTION_Pos)   /**< (ARM_DWT_DWT_FUNCTION1) Select action on comparator match Mask */
#define ARM_DWT_DWT_FUNCTION1_FUNCTION(value) (ARM_DWT_DWT_FUNCTION1_FUNCTION_Msk & ((value) << ARM_DWT_DWT_FUNCTION1_FUNCTION_Pos))
#define   ARM_DWT_DWT_FUNCTION1_FUNCTION_0_Val 0x0u                                           /**< (ARM_DWT_DWT_FUNCTION1) Disabled  */
#define   ARM_DWT_DWT_FUNCTION1_FUNCTION_4_Val 0x4u                                           /**< (ARM_DWT_DWT_FUNCTION1) PC Watchpoint Event (Instruction)  */
#define   ARM_DWT_DWT_FUNCTION1_FUNCTION_5_Val 0x5u                                           /**< (ARM_DWT_DWT_FUNCTION1) Watchpoint Event Read Only (Data)  */
#define   ARM_DWT_DWT_FUNCTION1_FUNCTION_6_Val 0x6u                                           /**< (ARM_DWT_DWT_FUNCTION1) Watchpoint Event Write Only (Data)  */
#define   ARM_DWT_DWT_FUNCTION1_FUNCTION_7_Val 0x7u                                           /**< (ARM_DWT_DWT_FUNCTION1) Watchpoing Event Write-Read (Data)  */
#define ARM_DWT_DWT_FUNCTION1_FUNCTION_0    (ARM_DWT_DWT_FUNCTION1_FUNCTION_0_Val << ARM_DWT_DWT_FUNCTION1_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION1) Disabled Position  */
#define ARM_DWT_DWT_FUNCTION1_FUNCTION_4    (ARM_DWT_DWT_FUNCTION1_FUNCTION_4_Val << ARM_DWT_DWT_FUNCTION1_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION1) PC Watchpoint Event (Instruction) Position  */
#define ARM_DWT_DWT_FUNCTION1_FUNCTION_5    (ARM_DWT_DWT_FUNCTION1_FUNCTION_5_Val << ARM_DWT_DWT_FUNCTION1_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION1) Watchpoint Event Read Only (Data) Position  */
#define ARM_DWT_DWT_FUNCTION1_FUNCTION_6    (ARM_DWT_DWT_FUNCTION1_FUNCTION_6_Val << ARM_DWT_DWT_FUNCTION1_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION1) Watchpoint Event Write Only (Data) Position  */
#define ARM_DWT_DWT_FUNCTION1_FUNCTION_7    (ARM_DWT_DWT_FUNCTION1_FUNCTION_7_Val << ARM_DWT_DWT_FUNCTION1_FUNCTION_Pos)  /**< (ARM_DWT_DWT_FUNCTION1) Watchpoing Event Write-Read (Data) Position  */
#define ARM_DWT_DWT_FUNCTION1_MATCHED_Pos   24                                             /**< (ARM_DWT_DWT_FUNCTION1) Comparator Match Position */
#define ARM_DWT_DWT_FUNCTION1_MATCHED_Msk   (0x1u << ARM_DWT_DWT_FUNCTION1_MATCHED_Pos)    /**< (ARM_DWT_DWT_FUNCTION1) Comparator Match Mask */
#define ARM_DWT_DWT_FUNCTION1_MATCHED       ARM_DWT_DWT_FUNCTION1_MATCHED_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_DWT_DWT_FUNCTION1_MATCHED_Msk instead */
#define ARM_DWT_DWT_FUNCTION1_MASK          0x100000Fu                                     /**< \deprecated (ARM_DWT_DWT_FUNCTION1) Register MASK  (Use ARM_DWT_DWT_FUNCTION1_Msk instead)  */
#define ARM_DWT_DWT_FUNCTION1_Msk           0x100000Fu                                     /**< (ARM_DWT_DWT_FUNCTION1) Register Mask  */

/* -------- ARM_DWT_DWT_PID4 : (ARM_DWT Offset: 0xfd0) (R/ 8) Peripheral ID Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_C_CODE:4;           /**< bit:   0..3  JEP106 C Code                            */
    uint8_t  BLOCK_COUNT:4;             /**< bit:   4..7  Block Count                              */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_PID4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

