remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_dwt.h
#define ARM_DWT_DWT_PID4_OFFSET             0xFD0                                         /**<  (ARM_DWT_DWT_PID4) Peripheral ID Register 4  Offset */
#define ARM_DWT_DWT_PID4_RESETVALUE         0x04u                                         /**<  (ARM_DWT_DWT_PID4) Peripheral ID Register 4  Reset Value */

#define ARM_DWT_DWT_PID4_JEP106_C_CODE_Pos  0                                              /**< (ARM_DWT_DWT_PID4) JEP106 C Code Position */
#define ARM_DWT_DWT_PID4_JEP106_C_CODE_Msk  (0xFu << ARM_DWT_DWT_PID4_JEP106_C_CODE_Pos)   /**< (ARM_DWT_DWT_PID4) JEP106 C Code Mask */
#define ARM_DWT_DWT_PID4_JEP106_C_CODE(value) (ARM_DWT_DWT_PID4_JEP106_C_CODE_Msk & ((value) << ARM_DWT_DWT_PID4_JEP106_C_CODE_Pos))
#define ARM_DWT_DWT_PID4_BLOCK_COUNT_Pos    4                                              /**< (ARM_DWT_DWT_PID4) Block Count Position */
#define ARM_DWT_DWT_PID4_BLOCK_COUNT_Msk    (0xFu << ARM_DWT_DWT_PID4_BLOCK_COUNT_Pos)     /**< (ARM_DWT_DWT_PID4) Block Count Mask */
#define ARM_DWT_DWT_PID4_BLOCK_COUNT(value) (ARM_DWT_DWT_PID4_BLOCK_COUNT_Msk & ((value) << ARM_DWT_DWT_PID4_BLOCK_COUNT_Pos))
#define ARM_DWT_DWT_PID4_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_PID4) Register MASK  (Use ARM_DWT_DWT_PID4_Msk instead)  */
#define ARM_DWT_DWT_PID4_Msk                0xFFu                                          /**< (ARM_DWT_DWT_PID4) Register Mask  */

/* -------- ARM_DWT_DWT_PID0 : (ARM_DWT Offset: 0xfe0) (R/ 8) Peripheral ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:8;             /**< bit:   0..7  Part Number Bits 7:0                     */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_PID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_PID0_OFFSET             0xFE0                                         /**<  (ARM_DWT_DWT_PID0) Peripheral ID Register 0  Offset */
#define ARM_DWT_DWT_PID0_RESETVALUE         0x0Au                                         /**<  (ARM_DWT_DWT_PID0) Peripheral ID Register 0  Reset Value */

#define ARM_DWT_DWT_PID0_PART_NUMBER_Pos    0                                              /**< (ARM_DWT_DWT_PID0) Part Number Bits 7:0 Position */
#define ARM_DWT_DWT_PID0_PART_NUMBER_Msk    (0xFFu << ARM_DWT_DWT_PID0_PART_NUMBER_Pos)    /**< (ARM_DWT_DWT_PID0) Part Number Bits 7:0 Mask */
#define ARM_DWT_DWT_PID0_PART_NUMBER(value) (ARM_DWT_DWT_PID0_PART_NUMBER_Msk & ((value) << ARM_DWT_DWT_PID0_PART_NUMBER_Pos))
#define ARM_DWT_DWT_PID0_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_PID0) Register MASK  (Use ARM_DWT_DWT_PID0_Msk instead)  */
#define ARM_DWT_DWT_PID0_Msk                0xFFu                                          /**< (ARM_DWT_DWT_PID0) Register Mask  */

/* -------- ARM_DWT_DWT_PID1 : (ARM_DWT Offset: 0xfe4) (R/ 8) Peripheral ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:4;             /**< bit:   0..3  Part Number Bits 11:8                    */
    uint8_t  JEP106_ID_3_0:4;           /**< bit:   4..7  JEP106 ID Code Bits 3:0                  */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_PID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_PID1_OFFSET             0xFE4                                         /**<  (ARM_DWT_DWT_PID1) Peripheral ID Register 1  Offset */
#define ARM_DWT_DWT_PID1_RESETVALUE         0xB0u                                         /**<  (ARM_DWT_DWT_PID1) Peripheral ID Register 1  Reset Value */

#define ARM_DWT_DWT_PID1_PART_NUMBER_Pos    0                                              /**< (ARM_DWT_DWT_PID1) Part Number Bits 11:8 Position */
#define ARM_DWT_DWT_PID1_PART_NUMBER_Msk    (0xFu << ARM_DWT_DWT_PID1_PART_NUMBER_Pos)     /**< (ARM_DWT_DWT_PID1) Part Number Bits 11:8 Mask */
#define ARM_DWT_DWT_PID1_PART_NUMBER(value) (ARM_DWT_DWT_PID1_PART_NUMBER_Msk & ((value) << ARM_DWT_DWT_PID1_PART_NUMBER_Pos))
#define ARM_DWT_DWT_PID1_JEP106_ID_3_0_Pos  4                                              /**< (ARM_DWT_DWT_PID1) JEP106 ID Code Bits 3:0 Position */
#define ARM_DWT_DWT_PID1_JEP106_ID_3_0_Msk  (0xFu << ARM_DWT_DWT_PID1_JEP106_ID_3_0_Pos)   /**< (ARM_DWT_DWT_PID1) JEP106 ID Code Bits 3:0 Mask */
#define ARM_DWT_DWT_PID1_JEP106_ID_3_0(value) (ARM_DWT_DWT_PID1_JEP106_ID_3_0_Msk & ((value) << ARM_DWT_DWT_PID1_JEP106_ID_3_0_Pos))
#define ARM_DWT_DWT_PID1_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_PID1) Register MASK  (Use ARM_DWT_DWT_PID1_Msk instead)  */
#define ARM_DWT_DWT_PID1_Msk                0xFFu                                          /**< (ARM_DWT_DWT_PID1) Register Mask  */

/* -------- ARM_DWT_DWT_PID2 : (ARM_DWT Offset: 0xfe8) (R/ 8) Peripheral ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_ID_6_4:3;           /**< bit:   0..2  JEP106 ID Code Bits 6:4                  */
    uint8_t  JEDEC_USED:1;              /**< bit:      3  JEDEC Used                               */
    uint8_t  REVISION:4;                /**< bit:   4..7  Revision                                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_PID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_PID2_OFFSET             0xFE8                                         /**<  (ARM_DWT_DWT_PID2) Peripheral ID Register 2  Offset */
#define ARM_DWT_DWT_PID2_RESETVALUE         0x0Bu                                         /**<  (ARM_DWT_DWT_PID2) Peripheral ID Register 2  Reset Value */

#define ARM_DWT_DWT_PID2_JEP106_ID_6_4_Pos  0                                              /**< (ARM_DWT_DWT_PID2) JEP106 ID Code Bits 6:4 Position */
#define ARM_DWT_DWT_PID2_JEP106_ID_6_4_Msk  (0x7u << ARM_DWT_DWT_PID2_JEP106_ID_6_4_Pos)   /**< (ARM_DWT_DWT_PID2) JEP106 ID Code Bits 6:4 Mask */
#define ARM_DWT_DWT_PID2_JEP106_ID_6_4(value) (ARM_DWT_DWT_PID2_JEP106_ID_6_4_Msk & ((value) << ARM_DWT_DWT_PID2_JEP106_ID_6_4_Pos))
#define ARM_DWT_DWT_PID2_JEDEC_USED_Pos     3                                              /**< (ARM_DWT_DWT_PID2) JEDEC Used Position */
#define ARM_DWT_DWT_PID2_JEDEC_USED_Msk     (0x1u << ARM_DWT_DWT_PID2_JEDEC_USED_Pos)      /**< (ARM_DWT_DWT_PID2) JEDEC Used Mask */
#define ARM_DWT_DWT_PID2_JEDEC_USED         ARM_DWT_DWT_PID2_JEDEC_USED_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_DWT_DWT_PID2_JEDEC_USED_Msk instead */
#define ARM_DWT_DWT_PID2_REVISION_Pos       4                                              /**< (ARM_DWT_DWT_PID2) Revision Position */
#define ARM_DWT_DWT_PID2_REVISION_Msk       (0xFu << ARM_DWT_DWT_PID2_REVISION_Pos)        /**< (ARM_DWT_DWT_PID2) Revision Mask */
#define ARM_DWT_DWT_PID2_REVISION(value)    (ARM_DWT_DWT_PID2_REVISION_Msk & ((value) << ARM_DWT_DWT_PID2_REVISION_Pos))
#define ARM_DWT_DWT_PID2_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_PID2) Register MASK  (Use ARM_DWT_DWT_PID2_Msk instead)  */
#define ARM_DWT_DWT_PID2_Msk                0xFFu                                          /**< (ARM_DWT_DWT_PID2) Register Mask  */

/* -------- ARM_DWT_DWT_PID3 : (ARM_DWT Offset: 0xfec) (R/ 8) Peripheral ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CUSTOMER_MOD_NUMBER:4;     /**< bit:   0..3  Customer Modification Number             */
    uint8_t  ECO_REV_NUMBER:4;          /**< bit:   4..7  ECO Revision Number                      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_PID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_PID3_OFFSET             0xFEC                                         /**<  (ARM_DWT_DWT_PID3) Peripheral ID Register 3  Offset */
#define ARM_DWT_DWT_PID3_RESETVALUE         0x00u                                         /**<  (ARM_DWT_DWT_PID3) Peripheral ID Register 3  Reset Value */

