remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_dwt.h
#define ARM_DWT_DWT_PID3_CUSTOMER_MOD_NUMBER_Pos 0                                              /**< (ARM_DWT_DWT_PID3) Customer Modification Number Position */
#define ARM_DWT_DWT_PID3_CUSTOMER_MOD_NUMBER_Msk (0xFu << ARM_DWT_DWT_PID3_CUSTOMER_MOD_NUMBER_Pos)  /**< (ARM_DWT_DWT_PID3) Customer Modification Number Mask */
#define ARM_DWT_DWT_PID3_CUSTOMER_MOD_NUMBER(value) (ARM_DWT_DWT_PID3_CUSTOMER_MOD_NUMBER_Msk & ((value) << ARM_DWT_DWT_PID3_CUSTOMER_MOD_NUMBER_Pos))
#define ARM_DWT_DWT_PID3_ECO_REV_NUMBER_Pos 4                                              /**< (ARM_DWT_DWT_PID3) ECO Revision Number Position */
#define ARM_DWT_DWT_PID3_ECO_REV_NUMBER_Msk (0xFu << ARM_DWT_DWT_PID3_ECO_REV_NUMBER_Pos)  /**< (ARM_DWT_DWT_PID3) ECO Revision Number Mask */
#define ARM_DWT_DWT_PID3_ECO_REV_NUMBER(value) (ARM_DWT_DWT_PID3_ECO_REV_NUMBER_Msk & ((value) << ARM_DWT_DWT_PID3_ECO_REV_NUMBER_Pos))
#define ARM_DWT_DWT_PID3_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_PID3) Register MASK  (Use ARM_DWT_DWT_PID3_Msk instead)  */
#define ARM_DWT_DWT_PID3_Msk                0xFFu                                          /**< (ARM_DWT_DWT_PID3) Register Mask  */

/* -------- ARM_DWT_DWT_CID0 : (ARM_DWT Offset: 0xff0) (R/ 8) Component ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  DWT_CID0:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_CID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_CID0_OFFSET             0xFF0                                         /**<  (ARM_DWT_DWT_CID0) Component ID Register 0  Offset */
#define ARM_DWT_DWT_CID0_RESETVALUE         0x0Du                                         /**<  (ARM_DWT_DWT_CID0) Component ID Register 0  Reset Value */

#define ARM_DWT_DWT_CID0_DWT_CID0_Pos       0                                              /**< (ARM_DWT_DWT_CID0)  Position */
#define ARM_DWT_DWT_CID0_DWT_CID0_Msk       (0xFFu << ARM_DWT_DWT_CID0_DWT_CID0_Pos)       /**< (ARM_DWT_DWT_CID0)  Mask */
#define ARM_DWT_DWT_CID0_DWT_CID0(value)    (ARM_DWT_DWT_CID0_DWT_CID0_Msk & ((value) << ARM_DWT_DWT_CID0_DWT_CID0_Pos))
#define ARM_DWT_DWT_CID0_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_CID0) Register MASK  (Use ARM_DWT_DWT_CID0_Msk instead)  */
#define ARM_DWT_DWT_CID0_Msk                0xFFu                                          /**< (ARM_DWT_DWT_CID0) Register Mask  */

/* -------- ARM_DWT_DWT_CID1 : (ARM_DWT Offset: 0xff4) (R/ 8) Component ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  DWT_CID1:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_CID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_CID1_OFFSET             0xFF4                                         /**<  (ARM_DWT_DWT_CID1) Component ID Register 1  Offset */
#define ARM_DWT_DWT_CID1_RESETVALUE         0xE0u                                         /**<  (ARM_DWT_DWT_CID1) Component ID Register 1  Reset Value */

#define ARM_DWT_DWT_CID1_DWT_CID1_Pos       0                                              /**< (ARM_DWT_DWT_CID1)  Position */
#define ARM_DWT_DWT_CID1_DWT_CID1_Msk       (0xFFu << ARM_DWT_DWT_CID1_DWT_CID1_Pos)       /**< (ARM_DWT_DWT_CID1)  Mask */
#define ARM_DWT_DWT_CID1_DWT_CID1(value)    (ARM_DWT_DWT_CID1_DWT_CID1_Msk & ((value) << ARM_DWT_DWT_CID1_DWT_CID1_Pos))
#define ARM_DWT_DWT_CID1_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_CID1) Register MASK  (Use ARM_DWT_DWT_CID1_Msk instead)  */
#define ARM_DWT_DWT_CID1_Msk                0xFFu                                          /**< (ARM_DWT_DWT_CID1) Register Mask  */

/* -------- ARM_DWT_DWT_CID2 : (ARM_DWT Offset: 0xff8) (R/ 8) Component ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  DWT_CID2:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_CID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_CID2_OFFSET             0xFF8                                         /**<  (ARM_DWT_DWT_CID2) Component ID Register 2  Offset */
#define ARM_DWT_DWT_CID2_RESETVALUE         0x05u                                         /**<  (ARM_DWT_DWT_CID2) Component ID Register 2  Reset Value */

#define ARM_DWT_DWT_CID2_DWT_CID2_Pos       0                                              /**< (ARM_DWT_DWT_CID2)  Position */
#define ARM_DWT_DWT_CID2_DWT_CID2_Msk       (0xFFu << ARM_DWT_DWT_CID2_DWT_CID2_Pos)       /**< (ARM_DWT_DWT_CID2)  Mask */
#define ARM_DWT_DWT_CID2_DWT_CID2(value)    (ARM_DWT_DWT_CID2_DWT_CID2_Msk & ((value) << ARM_DWT_DWT_CID2_DWT_CID2_Pos))
#define ARM_DWT_DWT_CID2_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_CID2) Register MASK  (Use ARM_DWT_DWT_CID2_Msk instead)  */
#define ARM_DWT_DWT_CID2_Msk                0xFFu                                          /**< (ARM_DWT_DWT_CID2) Register Mask  */

/* -------- ARM_DWT_DWT_CID3 : (ARM_DWT Offset: 0xffc) (R/ 8) Component ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  DWT_CID3:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_DWT_DWT_CID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_DWT_DWT_CID3_OFFSET             0xFFC                                         /**<  (ARM_DWT_DWT_CID3) Component ID Register 3  Offset */
#define ARM_DWT_DWT_CID3_RESETVALUE         0xB1u                                         /**<  (ARM_DWT_DWT_CID3) Component ID Register 3  Reset Value */

#define ARM_DWT_DWT_CID3_DWT_CID3_Pos       0                                              /**< (ARM_DWT_DWT_CID3)  Position */
#define ARM_DWT_DWT_CID3_DWT_CID3_Msk       (0xFFu << ARM_DWT_DWT_CID3_DWT_CID3_Pos)       /**< (ARM_DWT_DWT_CID3)  Mask */
#define ARM_DWT_DWT_CID3_DWT_CID3(value)    (ARM_DWT_DWT_CID3_DWT_CID3_Msk & ((value) << ARM_DWT_DWT_CID3_DWT_CID3_Pos))
#define ARM_DWT_DWT_CID3_MASK               0xFFu                                          /**< \deprecated (ARM_DWT_DWT_CID3) Register MASK  (Use ARM_DWT_DWT_CID3_Msk instead)  */
#define ARM_DWT_DWT_CID3_Msk                0xFFu                                          /**< (ARM_DWT_DWT_CID3) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief ARM_DWT hardware registers */
typedef struct {  /* ARM DWT Control */
  RoReg   DWT_CTRL;       /**< (ARM_DWT Offset: 0x00) Control Register */
  __I  uint32_t Reserved1[6];
  RoReg   DWT_PCSR;       /**< (ARM_DWT Offset: 0x1C) Program Counter Sample Register */
  RwReg   DWT_COMP0;      /**< (ARM_DWT Offset: 0x20) DWT Compare Register 0 */
  RwReg8  DWT_MASK0;      /**< (ARM_DWT Offset: 0x24) DWT Mask Register 0 */
  __I  uint8_t  Reserved2[3];
  RoReg   DWT_FUNCTION0;  /**< (ARM_DWT Offset: 0x28) DWT Function Register 0 */
  __I  uint32_t Reserved3[1];
  RwReg   DWT_COMP1;      /**< (ARM_DWT Offset: 0x30) DWT Compare Register 1 */
  RwReg8  DWT_MASK1;      /**< (ARM_DWT Offset: 0x34) DWT Mask Register 1 */
  __I  uint8_t  Reserved4[3];
  RoReg   DWT_FUNCTION1;  /**< (ARM_DWT Offset: 0x38) DWT Function Register 1 */
  __I  uint32_t Reserved5[997];
  RoReg8  DWT_PID4;       /**< (ARM_DWT Offset: 0xFD0) Peripheral ID Register 4 */
  __I  uint8_t  Reserved6[15];
  RoReg8  DWT_PID0;       /**< (ARM_DWT Offset: 0xFE0) Peripheral ID Register 0 */
  __I  uint8_t  Reserved7[3];
  RoReg8  DWT_PID1;       /**< (ARM_DWT Offset: 0xFE4) Peripheral ID Register 1 */
  __I  uint8_t  Reserved8[3];
  RoReg8  DWT_PID2;       /**< (ARM_DWT Offset: 0xFE8) Peripheral ID Register 2 */
  __I  uint8_t  Reserved9[3];
  RoReg8  DWT_PID3;       /**< (ARM_DWT Offset: 0xFEC) Peripheral ID Register 3 */
  __I  uint8_t  Reserved10[3];
  RoReg8  DWT_CID0;       /**< (ARM_DWT Offset: 0xFF0) Component ID Register 0 */
  __I  uint8_t  Reserved11[3];
  RoReg8  DWT_CID1;       /**< (ARM_DWT Offset: 0xFF4) Component ID Register 1 */
  __I  uint8_t  Reserved12[3];
  RoReg8  DWT_CID2;       /**< (ARM_DWT Offset: 0xFF8) Component ID Register 2 */
  __I  uint8_t  Reserved13[3];
  RoReg8  DWT_CID3;       /**< (ARM_DWT Offset: 0xFFC) Component ID Register 3 */
} ArmDwt;

