remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_dwt.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief ARM_DWT hardware registers */
typedef struct {  /* ARM DWT Control */
  __I  ARM_DWT_DWT_CTRL_Type          DWT_CTRL;       /**< Offset: 0x00 (R/   32) Control Register */
       RoReg8                         Reserved1[0x18];
  __I  ARM_DWT_DWT_PCSR_Type          DWT_PCSR;       /**< Offset: 0x1C (R/   32) Program Counter Sample Register */
  __IO ARM_DWT_DWT_COMP0_Type         DWT_COMP0;      /**< Offset: 0x20 (R/W  32) DWT Compare Register 0 */
  __IO ARM_DWT_DWT_MASK0_Type         DWT_MASK0;      /**< Offset: 0x24 (R/W   8) DWT Mask Register 0 */
       RoReg8                         Reserved2[0x3];
  __I  ARM_DWT_DWT_FUNCTION0_Type     DWT_FUNCTION0;  /**< Offset: 0x28 (R/   32) DWT Function Register 0 */
       RoReg8                         Reserved3[0x4];
  __IO ARM_DWT_DWT_COMP1_Type         DWT_COMP1;      /**< Offset: 0x30 (R/W  32) DWT Compare Register 1 */
  __IO ARM_DWT_DWT_MASK1_Type         DWT_MASK1;      /**< Offset: 0x34 (R/W   8) DWT Mask Register 1 */
       RoReg8                         Reserved4[0x3];
  __I  ARM_DWT_DWT_FUNCTION1_Type     DWT_FUNCTION1;  /**< Offset: 0x38 (R/   32) DWT Function Register 1 */
       RoReg8                         Reserved5[0xF94];
  __I  ARM_DWT_DWT_PID4_Type          DWT_PID4;       /**< Offset: 0xFD0 (R/    8) Peripheral ID Register 4 */
       RoReg8                         Reserved6[0xF];
  __I  ARM_DWT_DWT_PID0_Type          DWT_PID0;       /**< Offset: 0xFE0 (R/    8) Peripheral ID Register 0 */
       RoReg8                         Reserved7[0x3];
  __I  ARM_DWT_DWT_PID1_Type          DWT_PID1;       /**< Offset: 0xFE4 (R/    8) Peripheral ID Register 1 */
       RoReg8                         Reserved8[0x3];
  __I  ARM_DWT_DWT_PID2_Type          DWT_PID2;       /**< Offset: 0xFE8 (R/    8) Peripheral ID Register 2 */
       RoReg8                         Reserved9[0x3];
  __I  ARM_DWT_DWT_PID3_Type          DWT_PID3;       /**< Offset: 0xFEC (R/    8) Peripheral ID Register 3 */
       RoReg8                         Reserved10[0x3];
  __I  ARM_DWT_DWT_CID0_Type          DWT_CID0;       /**< Offset: 0xFF0 (R/    8) Component ID Register 0 */
       RoReg8                         Reserved11[0x3];
  __I  ARM_DWT_DWT_CID1_Type          DWT_CID1;       /**< Offset: 0xFF4 (R/    8) Component ID Register 1 */
       RoReg8                         Reserved12[0x3];
  __I  ARM_DWT_DWT_CID2_Type          DWT_CID2;       /**< Offset: 0xFF8 (R/    8) Component ID Register 2 */
       RoReg8                         Reserved13[0x3];
  __I  ARM_DWT_DWT_CID3_Type          DWT_CID3;       /**< Offset: 0xFFC (R/    8) Component ID Register 3 */
} ArmDwt;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_ARM_DWT_COMPONENT_ */
